In [1]:
from sqlalchemy import create_engine
from pysandag.database import get_connection_string
import pandas as pd

In [ ]:
urbansim_engine = create_engine(get_connection_string("configs/dbconfig.yml", 'urbansim_database'))

In [5]:
households_sql = 'SELECT household_id, building_id, persons, age_of_head, income, children FROM spacecore.urbansim.households'

In [8]:
defm_sql = '''
SELECT yr as [year], hh_income_id as income_quartile, hh_income_label, hh 
FROM isam.defm.households WHERE dem_version = 'S0021' and eco_version = '001' AND yr >= 2015'''

In [6]:
households_df = pd.read_sql(households_sql, urbansim_engine, index_col='household_id')

In [9]:
defm_df = pd.read_sql(defm_sql, urbansim_engine)

In [23]:
households_df.head()

              building_id  persons  age_of_head  income  children
household_id
2                  650188        4           50   12500         2
9                  433969        3           37  130000         1
20                 389948        3           37  130000         1
27                  70215        3           37  130000         1
34                  70261        3           37  130000         1

In [24]:
defm_df.head()

   year  income_quartile        hh_income_label      hh
0  2015                1          <30,000 $2014  254394
1  2015                2    30,000-59,999 $2014  274399
2  2015                3    60,000-99,999 $2014  256376
3  2015                4  100,000-149,999 $2014  186981
4  2015                5         >149,999 $2014  177003

In [33]:
households_df.income.max()

1406500

In [40]:
households_df.income.min()

-19000

In [50]:
bins = [households_df.income.min()-1, 30000, 59999, 99999, 149999,households_df.income.max()+1]

In [51]:
bins

[-19001, 30000, 59999, 99999, 149999, 1406501]

In [52]:
group_names = ['1','2','3','4','5']

In [53]:
households_df['income_cut'] = pd.cut(households_df['income'], bins,labels=group_names)

In [54]:
households_df.head()

              building_id  persons  age_of_head  income  children income_cut
household_id
2                  650188        4           50   12500         2          1
9                  433969        3           37  130000         1          4
20                 389948        3           37  130000         1          4
27                  70215        3           37  130000         1          4
34                  70261        3           37  130000         1          4

In [55]:
households_df.to_csv('data/households_df_income.csv')